Revit 2027 API
LoadCombination.Create(Document, String) Method
 Creates a new default LoadCombination.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LoadCombination Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As LoadCombination
public:
static LoadCombination^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> LoadCombination
Parameters
document Document
 The Document to which new load combination element will be added.
name String
 The name of the load combination.
Return Value
LoadCombination
 The newly created load combination element if successful, null otherwise.
Exceptions
Exception | Condition
ArgumentException |  The given name is not unique -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LoadCombination Class
Create Overload
Autodesk.Revit.DB.Structure Namespace